input/images-source/usfr-1.plantuml
@startuml

package "Healthcare Facility" {
    node "Data Source (EHR)" as EHR
}

package "NHSN" {
    node "Measure Evaluation Engine" as MEE
    node "Measure Source" as MS
    node "MeasureReport Recipient and Other NHSN Systems" as Recipient
}

EHR <-- MEE : (2)\n Query Data Source
MEE -down-> MS : (1)\n Retrieve Measure Bundle
MEE -right-> Recipient : (3)\n Submit MeasureReport Bundle


@enduml
